Th0masclassic/PROJECT_PINKEVA_TAG_w_SUBS/Test/Apple_FindMy_test/ESP32/sdkconfig.defaults
# Pinkeva development target baseline: classic ESP32 (Xtensa).
CONFIG_IDF_TARGET="esp32"
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_BLE_SMP_BOND_NVS_FLASH=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BTDM_CTRL_BLE_MAX_CONN=1
CONFIG_BTDM_CTRL_MODEM_SLEEP=y
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=80
CONFIG_PINQEVA_DEV_BYPASS_BOOTSTRAP=y
CONFIG_PINQEVA_BUZZER_GPIO=25
CONFIG_PINQEVA_BUZZER_FREQUENCY_HZ=4000
CONFIG_PINQEVA_FINDER_INTERVAL_MS=250
CONFIG_PINQEVA_FINDER_SLOT_MS=500
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
